# Assignment 3

## Descriptive Statistics - Measures of Central Tendency and variability 

Perform the following operations on any open-source dataset (e.g., data.csv) 

1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable. 

2. Write a Python program to display some basic statistical details like percentile, mean, standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris- verginica’ of iris.csv dataset. 

Provide the codes with outputs and explain everything that you do in this step.

In [37]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

### PartI: This is one sample set of steps, students may try any other way  

1. Open Jupyter notebook file 
2. Import Numpy 
3. Import Pandas 
4. Read “nba.csv” sample dataset in pandas data frame with the help of read_csv function, dataset available in the following link 
https://drive.google.com/file/d/1kH6mN8y0Eo6u7zlYvcEqP9uIaIPFdYMQ/view?usp=sharing 
5. Use shape, head, dtypes, isnull to get familiar with the dataset 
6. Calculate mode using mode() function on a sample column, eg. college  
7. Calculate mean using mean() function on a sample column, eg. Salary 
8. Use value_counts on sample column, eg. Age 
9. Use groupby on a sample column, eg. Age and Salary

### 4. Read “nba.csv” sample dataset in pandas data frame with the help of read_csv function, dataset available in the following link 
https://drive.google.com/file/d/1kH6mN8y0Eo6u7zlYvcEqP9uIaIPFdYMQ/view?usp=sharing

In [23]:
data = pd.read_csv("nba.csv")

### 5. Use shape, head, dtypes, isnull to get familiar with the dataset 
head()

In [24]:
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

shape

In [25]:
data.shape

(458, 9)

dtypes

In [26]:
data.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

isnull()

In [27]:
data.isnull()

      Name   Team  Number  Position    Age  Height  Weight  College  Salary
0    False  False   False     False  False   False   False    False   False
1    False  False   False     False  False   False   False    False   False
2    False  False   False     False  False   False   False    False    True
3    False  False   False     False  False   False   False    False   False
4    False  False   False     False  False   False   False     True   False
..     ...    ...     ...       ...    ...     ...     ...      ...     ...
453  False  False   False     False  False   False   False    False   False
454  False  False   False     False  False   False   False     True   False
455  False  False   False     False  False   False   False     True   False
456  False  False   False     False  False   False   False    False   False
457   True   True    True      True   True    True    True     True    True

[458 rows x 9 columns]

### 6. Calculate mode using mode() function on a sample column, eg. college

In [28]:
data.mode(numeric_only=True)

   Number   Age  Weight    Salary
0     5.0  24.0   220.0  947276.0

mode() for college

In [29]:
data["College"].mode()

0    Kentucky
Name: College, dtype: object

In [30]:
data.mode(axis=1, numeric_only=True)

        0     1      2          3
0     0.0  25.0  180.0  7730337.0
1    25.0  99.0  235.0  6796117.0
2    27.0  30.0  205.0        NaN
3    22.0  28.0  185.0  1148640.0
4     8.0  29.0  231.0  5000000.0
..    ...   ...    ...        ...
453   8.0  26.0  203.0  2433333.0
454  24.0  25.0  179.0   900000.0
455  21.0  26.0  256.0  2900000.0
456  24.0  26.0  231.0   947276.0
457   NaN   NaN    NaN        NaN

[458 rows x 4 columns]

### 7. Calculate mean using mean() function on a sample column, eg. Salary

In [31]:
data.median(numeric_only=True)

Number         13.0
Age            26.0
Weight        220.0
Salary    2839073.0
dtype: float64

median() for Salary

In [32]:
data["Salary"].median()

2839073.0

### 8. Use value_counts on sample column, eg. Age

In [33]:
data.value_counts()

Name                    Team                   Number  Position  Age   Height  Weight  College         Salary
Aaron Brooks            Chicago Bulls          0.0     PG        31.0  6-0     161.0   Oregon          2250000.0     1
Mike Muscala            Atlanta Hawks          31.0    PF        24.0  6-11    240.0   Bucknell        947276.0      1
Mike Dunleavy           Chicago Bulls          34.0    SG        35.0  6-9     230.0   Duke            4500000.0     1
Mike Conley             Memphis Grizzlies      11.0    PG        28.0  6-1     175.0   Ohio State      9588426.0     1
Michael Kidd-Gilchrist  Charlotte Hornets      14.0    SF        22.0  6-7     232.0   Kentucky        6331404.0     1
                                                                                                                    ..
Hassan Whiteside        Miami Heat             21.0    C         26.0  7-0     265.0   Marshall        981348.0      1
Harrison Barnes         Golden State Warriors  40.0    SF        24.0  6-8     225.0   North Carolina  3873398.0     1
Greivis Vasquez         Milwaukee Bucks        21.0    PG        29.0  6-6     217.0   Maryland        6600000.0     1
Greg Monroe             Milwaukee Bucks        15.0    C         26.0  6-11    265.0   Georgetown      16407500.0    1
Zach Randolph           Memphis Grizzlies      50.0    PF        34.0  6-9     260.0   Michigan State  9638555.0     1
Name: count, Length: 364, dtype: int64

In [34]:
data["Age"].value_counts()

Age
24.0    47
25.0    45
27.0    41
23.0    41
26.0    36
28.0    31
30.0    31
29.0    28
22.0    26
31.0    22
20.0    19
21.0    19
33.0    14
32.0    13
34.0    10
36.0    10
35.0     9
37.0     4
38.0     4
40.0     3
39.0     2
19.0     2
Name: count, dtype: int64

### 9. Use groupby on a sample column, eg. Age and Salary

In [35]:
groupAS = data.groupby(["Age", "Salary"])

In [36]:
groupAS.first()

                          Name                    Team  Number Position  \
Age  Salary
19.0 1733040.0   Rashad Vaughn         Milwaukee Bucks    20.0       SG
     2127840.0    Devin Booker            Phoenix Suns     1.0       SG
20.0 525093.0   Christian Wood      Philadelphia 76ers    35.0       PF
     1131960.0    Kevon Looney   Golden State Warriors    36.0       SF
     1282080.0      Tyus Jones  Minnesota Timberwolves     1.0       PG
...                        ...                     ...     ...      ...
39.0 947726.0   Pablo Prigioni    Los Angeles Clippers     9.0       PG
     4088019.0    Vince Carter       Memphis Grizzlies    15.0       SG
40.0 250750.0     Andre Miller       San Antonio Spurs    24.0       PG
     5250000.0      Tim Duncan       San Antonio Spurs    21.0        C
     8500000.0   Kevin Garnett  Minnesota Timberwolves    21.0       PF

               Height  Weight         College
Age  Salary
19.0 1733040.0    6-6   202.0            UNLV
     2127840.0    6-6   206.0        Kentucky
20.0 525093.0    6-11   220.0            UNLV
     1131960.0    6-9   220.0            UCLA
     1282080.0    6-2   195.0            Duke
...               ...     ...             ...
39.0 947726.0     6-3   185.0            None
     4088019.0    6-6   220.0  North Carolina
40.0 250750.0     6-3   200.0            Utah
     5250000.0   6-11   250.0     Wake Forest
     8500000.0   6-11   240.0            None

[393 rows x 7 columns]